src/Documents/ИТСервисы_ПриказОВыводеИзПЭ/ИТСервисы_ПриказОВыводеИзПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ПриказОВыводеИзПЭ</name>
  <basedOn>Document.ИТСервисы_ПриказОВводеВПЭ</basedOn>
  <registerRecords>InformationRegister.ИТСервисы_СтатусыОбъектовИТ</registerRecords>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВывода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_СтатусыОбъектовИТ/ИТСервисы_СтатусыОбъектовИТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_СтатусыОбъектовИТ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыЖизненногоЦикла</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектУчета</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ИТСервисы_СтатусыЖизненногоЦикла/ИТСервисы_СтатусыЖизненногоЦикла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_СтатусыЖизненногоЦикла</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>ВПромышленнойЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВыведенИзЭксплуатации</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИТСервисы_ПриказОВыводеИзПЭ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Движения.ИТСервисы_СтатусыОбъектовИТ.Записывать = Истина;
	Движения.ИТСервисы_СтатусыОбъектовИТ.Очистить();

	Если ЗначениеЗаполнено(ИТСервис) Тогда
		Движение = Движения.ИТСервисы_СтатусыОбъектовИТ.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ИТСервис;

		Движение.Статус = Перечисления.ИТСервисы_СтатусыЖизненногоЦикла.ВыведенИзЭксплуатации;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИТСервисы_ПриказОВводеВПЭ") Тогда
		ИТСервис = ДанныеЗаполнения.Проект;
		ДатаВывода = ТекущаяДата();
		Описание = "Вывод из эксплуатации на основании приказа о вводе №" + ДанныеЗаполнения.Номер;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приказ о выводе заполнен по данным ввода сервиса: " + ИТСервис.Наименование);		
	КонецЕсли;
КонецПроцедуры
